docs/org_mode_weekly_planner.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>My Org-mode Weekly Planner</title>
<meta name="generator" content="Org Mode" />
<link rel="stylesheet"href="resources/org.css"type="text/css" /><header><a href="index.html">Home</a>&emsp;<a href="about.html">About Me</a>&emsp;<a href="https://github.com/abdrysdale/abdrysdale.github.io">Source</a>&emsp;<a href="sitemap.html">Sitemap</a>&emsp;<a href="feed.xml">RSS</a></header>
</head>
<body>
<div id="content" class="content">
<h1 class="title">My Org-mode Weekly Planner</h1>
<div id="table-of-contents" role="doc-toc">
<h2>Table of Contents</h2>
<div id="text-table-of-contents" role="doc-toc">
<ul>
<li><a href="#orga26068c">A clock table</a></li>
<li><a href="#orgdca217c">A Time Sheet</a></li>
<li><a href="#org96ca8fc">Current Open Issue</a></li>
<li><a href="#org4b8738d">Current Open PRs</a></li>
<li><a href="#org5c07700">Plan</a></li>
</ul>
</div>
</div>
<p>
In general it has a clock table to keep track of tasks I've worked on, a time sheet to keep track of of working hours, a list of currently open issues &amp; pull requests along with a general plan for the week.
</p>

<p>
All of this lives in my <code>agenda.org</code> document under the heading <code>Journal</code> and then under a sub-heading for each week. That way, I can easily pull what I've worked on for particular week along with the hours I've worked and the workload of that week (e.g. Open Issues/PRs).
</p>

<div id="outline-container-orga26068c" class="outline-2">
<h2 id="orga26068c">A clock table</h2>
<div class="outline-text-2" id="text-orga26068c">
<p>
A clock table to keep track of what tasks that I've worked on during the week:
</p>

<pre class="example">
#+BEGIN: clocktable :scope agenda-with-archives :maxlevel 10 :block thisweek :link t :step day :formula % :fileskip0 t :stepskip0 t :emphasize t :indent t :filetitle t

#+END:
</pre>
</div>
</div>

<div id="outline-container-orgdca217c" class="outline-2">
<h2 id="orgdca217c">A Time Sheet</h2>
<div class="outline-text-2" id="text-orgdca217c">
<p>
A time sheet to keep track of the hours I've worked:
</p>

<pre class="example">
#+NAME:clock-data
|        Day | Clock In | Clock Out | Break Taken | Duration | Cumulative (Minus Breaks) |
|------------+----------+-----------+-------------+----------+---------------------------|
| 2026-02-23 |    09:00 |     17:00 |       00:30 |    08:00 |                     07:30 |
| 2026-02-24 |    09:00 |     17:00 |       00:30 |    08:00 |                     15:00 |
| 2026-02-25 |    09:00 |     17:00 |       00:30 |    08:00 |                     22:30 |
| 2026-02-26 |    09:00 |     17:00 |       00:30 |    08:00 |                     30:00 |
| 2026-02-27 |    09:00 |     17:00 |       00:30 |    08:00 |                     37:30 |
#+TBLFM: $5='(apply #'(lambda (a b) (if (and (&gt; a 0) (&gt; b 0)) (- a b) 0)) '($3 $2));U::$6=$5+@-1-$4;U
</pre>

<p>
along with a Python script to update a main Excel document:
</p>

<pre class="example" id="org8d3759d">
"""Export work times to shared excel sheet."""
# Python imports
from pathlib import Path

# Module imports
import pandas as pd
import openpyxl

filename = (
    Path("C:\\")
    / "Users"
    / "me"
    / "documents"
    / "hours.xlsx"
)

cols, data = clock_data[0], clock_data[1:]
df = pd.DataFrame(data, columns=cols)
sheet_title = df.iloc[0, 0]

print(f"Saving data to {filename} in {sheet_title}")

wb = openpyxl.load_workbook(filename)
if sheet_title not in wb.sheetnames:
    wb.create_sheet(title=sheet_title, index=0)
    wb.active = wb[sheet_title]
    wb.save(filename)
    print("Created a new sheet.")
wb.close()

with pd.ExcelWriter(
        filename, engine="openpyxl", mode="a", if_sheet_exists="replace",
) as writer:
    df.to_excel(writer, sheet_name=sheet_title, index=False)

print(f"Data:\n{df}")
</pre>

<p>
Crucially the Python script has the header:
</p>

<pre class="example">
#+begin_src python :var clock_data=clock-data :colnames no :results output
</pre>
</div>
</div>

<div id="outline-container-org96ca8fc" class="outline-2">
<h2 id="org96ca8fc">Current Open Issue</h2>
<div class="outline-text-2" id="text-org96ca8fc">
<p>
A little shell command that displays the currently open issues:
</p>

<pre class="example" id="org56d8847">
#+begin_src sh :results output drawer
  echo "| Repo | Title | Last Updated |"
  echo "|-|-|-|"
  gh search issues --involves abdrysdale --state open \
     --sort updated \
     --json title,repository,url,updatedAt --template \
     '{{range .}}{{"|"}}{{.repository.nameWithOwner}}{{"|[["}}{{.url}}{{"]["}}{{.title}}{{"]]|"}}{{timeago .updatedAt}}{{"\n"}}{{end}}'
#+end_src
</pre>
</div>
</div>

<div id="outline-container-org4b8738d" class="outline-2">
<h2 id="org4b8738d">Current Open PRs</h2>
<div class="outline-text-2" id="text-org4b8738d">
<p>
A similar shell command that displays the currently open PRs.
</p>

<pre class="example" id="orge771c57">
#+begin_src sh :results output drawer
  echo "| Repo | Title | Last Updated |"
  echo "|-|-|-|"
  gh search prs --involves abdrysdale --state open \
     --sort updated \
     --json title,repository,url,updatedAt --template \
     '{{range .}}{{"|"}}{{.repository.nameWithOwner}}{{"|[["}}{{.url}}{{"]["}}{{.title}}{{"]]|"}}{{timeago .updatedAt}}{{"\n"}}{{end}}'
#+end_src
</pre>
</div>
</div>

<div id="outline-container-org5c07700" class="outline-2">
<h2 id="org5c07700">Plan</h2>
<div class="outline-text-2" id="text-org5c07700">
<p>
And finally a plan like this:
</p>

<pre class="example">
*Core*

- [ ] Item 1.
- [ ] Item 2.
- [ ] Item 3.


*Ambitious*

- [ ] Item 4.
- [ ] Item 5.
</pre>

<p>
And a nifty keybinding to link to plan tasks to the root tasks agenda:
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="font-weight: bold; font-style: italic;">;; </span><span style="font-weight: bold; font-style: italic;">Source: https://gist.github.com/mmarshall540/61601368dbb6143c04aff59060096682
</span>(<span style="font-weight: bold;">defun</span> <span style="font-weight: bold;">my/org-id-insert-link-with-completion</span> ()
  <span style="font-style: italic;">"Insert a link to another heading using completion.
Use the heading text as default description, but provide an
opportunity to edit same.
The `</span><span style="font-weight: bold; font-style: italic; text-decoration: underline;">org-outline-path-complete-in-steps</span><span style="font-style: italic;">' option affects the behavior of
this command.  It works best when set to nil.
To change which headings are presented as candidates, modify the command
by adding a `</span><span style="font-weight: bold; font-style: italic; text-decoration: underline;">targets</span><span style="font-style: italic;">' argument in the call to
`</span><span style="font-weight: bold; font-style: italic; text-decoration: underline;">org-id-get-with-outline-path-completion</span><span style="font-style: italic;">'.  By default all headings in
the current buffer are presented as completion-candidates, but you can
use any value that would work as a value of `</span><span style="font-weight: bold; font-style: italic; text-decoration: underline;">org-refile-targets</span><span style="font-style: italic;">' to set
the completion candidates to use.  Or you could do something fancy with
prefix arguments to select different sets of targets.  I am too lazy to
do that at the moment."</span>
  (<span style="font-weight: bold;">interactive</span>)
  (<span style="font-weight: bold;">let*</span> ((id (org-id-get-with-outline-path-completion))
         (desc (<span style="font-weight: bold;">save-excursion</span>
                 (org-id-goto id)
                 (org-get-heading <span style="font-weight: bold;">:notags</span> <span style="font-weight: bold;">:notodo</span> <span style="font-weight: bold;">:noprty</span> <span style="font-weight: bold;">:nocmnt</span>))))
    (funcall-interactively 'org-insert-link nil (concat <span style="font-style: italic;">"id:"</span> id) desc)))

(keymap-set org-mode-map <span style="font-style: italic;">"C-c C-M-l"</span>
            'my/org-id-insert-link-with-completion)
</pre>
</div>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="date">Date: 2026-02-24 Tue 00:00</p>
<p class="creator"><a href="https://www.gnu.org/software/emacs/">Emacs</a> 29.3 (<a href="https://orgmode.org">Org</a> mode 9.6.15)</p>
</div>
</body>
</html>
